In [17]:
import pandas as pd
import numpy as np

df_empleados = pd.read_csv('./empleados.csv')
df_bonificaciones = pd.read_csv('./bonificaciones.csv')

print(df_empleados)
print(df_bonificaciones)

   ID_Empleado  Nombre Departamento  Salario Fecha_Ingreso
0            1     Ana       Ventas    50000    2015-06-01
1            2    Luis           TI    70000    2017-03-15
2            3   Pedro    Marketing    60000    2018-11-01
3            4   Marta           TI    75000    2020-01-10
4            5  Carlos       Ventas    52000    2016-05-01
5            6   Laura    Marketing    59000    2019-07-23
6            7    José       Ventas    48000    2021-01-01
   ID_Empleado  Bonificacion
0            1          5000
1            2          8000
2            3          3000
3            4         10000
4            5          2500
5            6          4000
6            7          1500

In [18]:
def salarioAnual(salario):
    return salario * 12

#df_empleados['Salario_Anual'] = df_empleados['Salario'].apply(salarioAnual)
df_empleados['Salario_Anual'] = df_empleados['Salario'].apply(lambda salario: salario * 12)
print(df_empleados)

   ID_Empleado  Nombre Departamento  Salario Fecha_Ingreso  Salario_Anual
0            1     Ana       Ventas    50000    2015-06-01         600000
1            2    Luis           TI    70000    2017-03-15         840000
2            3   Pedro    Marketing    60000    2018-11-01         720000
3            4   Marta           TI    75000    2020-01-10         900000
4            5  Carlos       Ventas    52000    2016-05-01         624000
5            6   Laura    Marketing    59000    2019-07-23         708000
6            7    José       Ventas    48000    2021-01-01         576000

In [19]:
def antiguedad_5_anos(fecha_ingreso):
    today = pd.to_datetime('today')
    antiguedad = today - pd.to_datetime(fecha_ingreso)
    return antiguedad.days / 365 > 5

df_empleados['Antiguedad_mayor_5'] = df_empleados['Fecha_Ingreso'].apply(antiguedad_5_anos)
print(df_empleados)

   ID_Empleado  Nombre Departamento  Salario Fecha_Ingreso  Salario_Anual  \
0            1     Ana       Ventas    50000    2015-06-01         600000
1            2    Luis           TI    70000    2017-03-15         840000
2            3   Pedro    Marketing    60000    2018-11-01         720000
3            4   Marta           TI    75000    2020-01-10         900000
4            5  Carlos       Ventas    52000    2016-05-01         624000
5            6   Laura    Marketing    59000    2019-07-23         708000
6            7    José       Ventas    48000    2021-01-01         576000

   Antiguedad_mayor_5
0                True
1                True
2                True
3                True
4                True
5                True
6               False

# Pivot Tables

In [20]:
pivot_departamento = df_empleados.pivot_table(values='Salario', index='Departamento', aggfunc='mean')
print(pivot_departamento)

              Salario
Departamento
Marketing     59500.0
TI            72500.0
Ventas        50000.0

## Merge y Join

In [21]:
df_completo = pd.merge(df_empleados, df_bonificaciones, on='ID_Empleado', how='left')
print(df_completo)

   ID_Empleado  Nombre Departamento  Salario Fecha_Ingreso  Salario_Anual  \
0            1     Ana       Ventas    50000    2015-06-01         600000
1            2    Luis           TI    70000    2017-03-15         840000
2            3   Pedro    Marketing    60000    2018-11-01         720000
3            4   Marta           TI    75000    2020-01-10         900000
4            5  Carlos       Ventas    52000    2016-05-01         624000
5            6   Laura    Marketing    59000    2019-07-23         708000
6            7    José       Ventas    48000    2021-01-01         576000

   Antiguedad_mayor_5  Bonificacion
0                True          5000
1                True          8000
2                True          3000
3                True         10000
4                True          2500
5                True          4000
6               False          1500

In [22]:
# asi se puede crear un data frame a partir de un objeto
data_departamentos = {
    'Departamento': ['Ventas', 'TI', 'Marketing'],
    'Ubicacion': ['CDMX', 'Monterrey','Puebla']
}
df_departamentos = pd.DataFrame(data_departamentos)
df_departamentos.set_index('Departamento', inplace=True)
print(df_departamentos)

              Ubicacion
Departamento
Ventas             CDMX
TI            Monterrey
Marketing        Puebla

In [23]:
#Aqui no se usa inplace=True por que no quiero cambiar el original
#Sin el implace regresa un nobeType
df_join = df_empleados.set_index('Departamento').join(df_departamentos)
print('')
print('Data combinada')
print(df_join)
print('')
print('Data original')
print(df_empleados)

Data combinada
              ID_Empleado  Nombre  Salario Fecha_Ingreso  Salario_Anual  \
Departamento
Ventas                  1     Ana    50000    2015-06-01         600000
TI                      2    Luis    70000    2017-03-15         840000
Marketing               3   Pedro    60000    2018-11-01         720000
TI                      4   Marta    75000    2020-01-10         900000
Ventas                  5  Carlos    52000    2016-05-01         624000
Marketing               6   Laura    59000    2019-07-23         708000
Ventas                  7    José    48000    2021-01-01         576000

              Antiguedad_mayor_5  Ubicacion
Departamento
Ventas                      True       CDMX
TI                          True  Monterrey
Marketing                   True     Puebla
TI                          True  Monterrey
Ventas                      True       CDMX
Marketing                   True     Puebla
Ventas                     False       CDMX

Data original
   ID_Empleado  Nombre Departamento  Salario Fecha_Ingreso  Salario_Anual  \
0            1     Ana       Ventas    50000    2015-06-01         600000
1            2    Luis           TI    70000    2017-03-15         840000
2            3   Pedro    Marketing    60000    2018-11-01         720000
3            4   Marta           TI    75000    2020-01-10         900000
4            5  Carlos       Ventas    52000    2016-05-01         624000
5            6   Laura    Marketing    59000    2019-07-23         708000
6            7    José       Ventas    48000    2021-01-01         576000

   Antiguedad_mayor_5
0                True
1                True
2                True
3                True
4                True
5                True
6               False